# Brewfile.
#
# brew tap homebrew/bundle
# brew bundle

tap "caskroom/cask"
tap "homebrew/dupes"
tap "homebrew/versions"

# *nix
brew "automake"
brew "diffutils"
brew "coreutils"
brew "cmake"
brew "gdb"
brew "gnu-sed"
brew "libtool"
brew "makedepend"

# Programming
brew "gcc"
brew "python"
brew "python3"
brew "perl"
brew "ruby"
brew "rust"
brew "go"
brew "node"
cask "java"

brew "postgresql"
brew "sqlite"
brew "redis"
cask "rdm"

brew "git"
brew "mercurial"

brew "vim"

# Web
brew "wget"
brew "curl"
brew "httpie"
brew "nmap"

# Tools
brew "enca"
brew "unrar"
brew "fish"
brew "tmux"
brew "mobile-shell"
brew "graphviz"
brew "hub"
brew "q"
brew "jq"
brew "cloc"
brew "cdiff"

# NTFS support
brew "ntfs-3g"
cask "osxfuse"

# Represent
brew "awscli"
brew "heroku"
brew "phantomjs"
brew "v8-315"
cask "ngrok"
